export const uk = {
  pages: [
    {
      path: '/',
      name: 'Головна',
    },
    {
      path: '/about',
      name: 'Про мене',
    },
    {
      path: '/skills',
      name: 'Навички',
    },
    {
      path: '/experience',
      name: 'Досвід',
    },
  ],
  home: {
    hi: 'Привіт, мене звати',
    name: 'Олександр Корневьский',
    iam: 'Я',
    aboutMe: 'Про мене',
    developer: 'РОЗРОБНИК',
  },
  about: {
    iam: 'Я',
    frontendDev: 'Frontend web розробник',
    exp: 'із понад річним досвідом у створенні сучасних',
    responsive: 'адаптивних',
    and: 'і',
    userFriendly: 'зручних',
    webApps: 'для користувачів веб-застосунків',
    hobbies:
      'У вільний час я люблю зустрічатися з друзями, грати у відеоігри та працювати над особистими проєктами.',
    focus: 'Зараз моя основна увага зосереджена на вдосконаленні',
    Frontend: 'Frontend',
    expertise: 'навичок',
    fullStack: 'але я також прагну розширити свої знання у full-stack розробці',
    goalsTitle: 'Мої цілі включають:',
    professionalGrowth: 'Професійний ріст',
    professionalGrowthDesc:
      'Розширення знань, освоєння нових технологій і вдосконалення наявних навичок',
    clearCommunication: 'Чітка комунікація',
    clearCommunicationDesc:
      'Сприяння відкритій і конструктивній комунікації з командою та керівництвом, підтримуючи чітке розуміння цілей проєкту',
    teamwork: 'Командна робота',
    teamworkDesc:
      'Співпраця з досвідченими колегами та участь у можливостях обміну знаннями',
    excitedToContribute:
      'Я в захваті від можливості приєднатися до команди, де я зможу продовжувати',
    growing: 'розвиватися',
    learning: 'навчатися',
    building: 'створювати',
    impactfulApps: 'корисні веб-застосунки',
  },
  skills: {
    showMore: 'Показати більше',
    showLess: 'Показати менше',
  },
  experience: {
    projects: [
      {
        companyName: 'Yuki Projects',
        companyLink: 'https://www.linkedin.com/company/yuki-projects/',
        role: 'Frontend web розробник',
        duration: 'Березень 2024 – теперішній час',
        highlights: [
          {
            title: 'Розробка повністю адаптивної багатосторінкової платформи оголошень',
            description: [
              'Система управління оголошеннями: створення, редагування та видалення.',
              'Пошук та фільтрація оголошень за категоріями, локаціями та іншими критеріями.',
              'Реалізація безпечних взаємодій між користувачами.',
            ],
            technologies: ['#React.js', '#TypeScript', '#react-router', '#Tailwind CSS'],
          },
          {
            title: 'Розробка повністю адаптивного інтерфейсу для панелі адміністратора',
            description: [
              'Елементи з можливістю перетягування.',
              'Візуалізація даних у вигляді графіків та таблиць.',
              'Інші функції панелі адміністратора.',
            ],
            technologies: ['#React.js', '#TypeScript', '#Material-UI'],
          },
        ],
      },
    ],
  },
  error: {
    home: 'На головну',
  },
};
